{"meta":{"title":"dydxs' blog","subtitle":"welcome","description":"","author":"dydxs","url":"https://dydxs.github.io","root":"/"},"pages":[],"posts":[{"title":"我写博客的初衷","slug":"hello world","date":"2021-01-23T05:05:53.311Z","updated":"2021-02-05T18:33:20.634Z","comments":true,"path":"2021/01/23/hello world/","link":"","permalink":"https://dydxs.github.io/2021/01/23/hello%20world/","excerpt":"我可能会在这里写一些所思所想，心情心得，或者分享一些读书笔记。","text":"我可能会在这里写一些所思所想，心情心得，或者分享一些读书笔记。 愿我的blog与我共同进步 宣布一件事 (♧◑ω◑)☞♡☜(◐ω◐♧) Mathematik und Computer-Wissenschaft 当我看到xll钱班自我介绍稿上写着“数学与计算机结合”字样（细节记不得了）的时候那心情不可言喻，不过也许我一开始有这想法正是受xll影响 到达终点之前没有人知道之前的选择是否正确（也许最后也不知道），但与其逡巡不敢进只会错失机会，“鲁莽要比怯懦更接近勇敢”。 一些关于我本人缺点的思考(:з」∠) 自信不足致使不够坚定、过于敏感、不能正视问题、不敢走自己的路(下面很多问题根源在此) 不够坦诚 常常由于不够坚定而白白浪费时间 轻微妄想症，不切实际的幻想过多 我的优势 正如一位友人所说“dy是不可模仿的”（也许他自己也忘了，但我还记得，就像我还记得那句“你拿dy和qzy比？”），我的经历、我的思维方式、我的观察力等等都不可模仿(๑&gt;؂&lt;๑） 小结 我羡慕那些每天被梦想叫起床的人，但我从未想过我也可以是，或者至少向他们靠近。 如果我的精神可以有稳定的寄托，我希望那不再是某个人或者某个物件，而是一个信念、一个理想、一个信仰（···） 此次更新为狂人呓语 很显然我在上次更新时仍是怯懦的，我应当承认我对几乎所有人都持有戒心，我很难信任其他人。 我目前所认知的原因 原生家庭之殇。在我看来，很多人不应当成为父母，尽管他们中的大多数并没有原罪。也许未来“父母”应当成为一种职业，而以延续文明为目的的生育应当受到严格监管。 深入骨髓融入血脉影响无处不在的基因。（以下内容假定进化论正确）我认为基因确有优劣之别（至少应当承认在某个特定时间内，否则谈何进化），很不幸但不得不承认那些遗传病患者的基因的确不够优质，（此外，一项不能说的常识是智商也有高下，控制方方面面的基因没有理由独独漏掉智力。）他们生理上无论如何都难以与身体健康的正常人竞争。而当我们把视角转向这些所谓正常人时，应当注意到基因在非“硬件”领域的影响。众所周知，一些罪犯表现得极具攻击性和侵略性是因为他们的性染色体出现了问题，我们在给予遗传病（一般意义上的遗传病）患者各种优惠时是否该宽恕这些罪犯的罪行呢？如果在细化到个人很大程度上由基因决定的性格脾气呢？现代社会自然选择对人的作用被大大减弱，而社会竞争以及一夫一妻制的普及很少使人失去生育权，无论什么样的基因几乎都不会从人类基因库中消失，但这对那些获得不利于社会竞争（比如···）基因的新生儿公平吗？在可预测的未来我们不会进行“人工选择”，发展教育才是出路。但教育可能永远治标不治本，而且获得不利基因的个体在竞争中处于劣势，占有的资源少，如何争取优质教育呢？真正的教育公平因材施教几时能实现？（马克思？马尔萨斯？马克沁？） 我的经历。我想有几乎推到三观再重建经历的人应该不多吧，搭乘过从一个世界到另一个世界的快车的人也不多吧 深深的虚无感。主要来自尤瓦尔·赫拉利的简史三部曲（轻视小说可能带来了一些问题），不展开说了。 我不知道我们的一切是否从宇宙诞生之初就已经决定，我不知道人的成功失败是否由客观环境决定，毕竟到目前为止没有科学可以支持自由意志 现在是凌晨两点半，缅怀无数与这些问题纠缠的夜和自习时间，写出来舒服许多，不管怎样我应该会选择相信未来","categories":[],"tags":[{"name":"随笔","slug":"随笔","permalink":"https://dydxs.github.io/tags/%E9%9A%8F%E7%AC%94/"}]}],"categories":[],"tags":[{"name":"随笔","slug":"随笔","permalink":"https://dydxs.github.io/tags/%E9%9A%8F%E7%AC%94/"}]}